// Suspicious URL clicked.
// Auther: Adarsh pandey
//Query 1: Defender For Endpoint -

DeviceNetworkEvents
| where RemoteUrl contains "http://solutionssolaires.nl"
| project Timestamp, RemoteUrl, RemoteIP, InitiatingProcessFolderPath, InitiatingProcessFileName, InitiatingProcessParentFileName, InitiatingProcessAccountName


//Query 2: Sentinel/Log Analytics

CommonSecurityLog
| where SourceHostName startswith "hostname"
| where RequestedUrl contians "https://lp.vbt.site"
| Project TimeGenerated, Activity, DeviceAction, DestinationHostName, SourceUserName


//Query 3: Zscaler hunting:
CommonSecurityLog
| where DeviceVendor contains "Zscaler"
| where RequestURL contains "malicous url"
| project TimeGenerated, RequestURL, SourceHostName, SourceUserName, Activity, DeviceAddress, DeviceVendor, DeviceAction, AdditionalExtensions
