// Stable Channel Update for Desktop, The Stable channel has been updated to 93.0.4577.82 for Windows, Mac and Linux which will roll out over the coming days/weeks
// Threat Hunting query(KQL) to investigate the released CVEs in your organization. 
// Created by Adarsh Pandey
// Reference: https://chromereleases.googleblog.com/2021/09/stable-channel-update-for-desktop.html
let ChromeCVE= dynamic(["CVE-2021-30625", // Use after free in Selection API
    "CVE-2021-30626", // Out of bounds memory access in ANGLE
    "CVE-2021-30627", // Type Confusion in Blink layout
    "CVE-2021-30628", // Stack buffer overflow in ANGLE
    "CVE-2021-30629", // Use after free in Permissions
    "CVE-2021-30630", // Inappropriate implementation in Blink 
    "CVE-2021-30631", // Type Confusion in Blink layout
    "CVE-2021-30632", // Out of bounds write in V8
    "CVE-2021-30633"]); // Use after free in Indexed DB API
DeviceTvmSoftwareInventoryVulnerabilities
| where CveId in(ChromeCVE)
| summarize ChromeCVE = count(), make_set(CveId) by DeviceName, SoftwareName, SoftwareVersion
