// Chrome 93.0.4577.63 fixes and improvements - Google releases Chrome 93.0.4577.63 Security Fixes.
// Threat Hunting query(KQL) to investigate the released CVEs in your organization. 
// Created by Adarsh Pandey
// Reference: https://chromereleases.googleblog.com/2021/08/stable-channel-update-for-desktop_31.html
let ChromeCVE= dynamic(["CVE-2021-30606", // Use after free in Blink.
    "CVE-2021-30607", // Use after free in Permissions.
    "CVE-2021-30608", // Use after free in Web Share
    "CVE-2021-30609", // Use after free in Sign-In.
    "CVE-2021-30610", // Use after free in Extensions API.
    "CVE-2021-30611", // Use after free in WebRTC.
    "CVE-2021-30612", // Use after free in WebRTC.
    "CVE-2021-30613", // Use after free in Base internals. 
    "CVE-2021-30614", // Heap buffer overflow in TabStrip. 
    "CVE-2021-30615", // Cross-origin data leak in Navigation. 
    "CVE-2021-30616", // Use after free in Media. 
    "CVE-2021-30617", // Policy bypass in Blink.
    "CVE-2021-30618", // Inappropriate implementation in DevTools. 
    "CVE-2021-30619", // UI Spoofing in Autofill.
    "CVE-2021-30620", // Insufficient policy enforcement in Blink. 
    "CVE-2021-30621", // UI Spoofing in Autofill. 
    "CVE-2021-30622", // Use after free in WebApp Installs.
    "CVE-2021-30623", // Use after free in Bookmarks.
    "CVE-2021-30624"]); // Use after free in Autofill.
DeviceTvmSoftwareInventoryVulnerabilities
| where CveId in(ChromeCVE)
| summarize ChromeCVE = count(), make_set(CveId) by DeviceName, SoftwareName, SoftwareVersion
