// Suspicious URL clicked.
// Auther: Adarsh pandey
//Query 1: Defender For Endpoint -

DeviceNetworkEvents
| where Remoteurl contains "https://lp.vbt.site"
| project Timestamp, Remoteurl, RemoteIP, InitiatingProcessFolderPath, InitiatingProcessFileName, InitiatingProcessParentFileName, InitiatingProcessAccount


//Query 2: Sentinel/Log Analytics

CommonSecurityLog
| where SourceHostName startswith "hostname"
| where RequestedUrl contians "https://lp.vbt.site"
| Project TimeGenerated, Activity, DeviceAction, DestinationHostName, SourceUserName


