Query: Interactive Logon Analysis with User Location Details
// This KQL query analyzes non-interactive logon activities of users, focusing on their location details. It retrieves data from the "AADNonInteractiveUserSignInLogs" table. The query extends the results with city, country/region, and state information parsed from the "LocationDetails" field. The results are sorted by the time the logon occurred and then projected to display relevant fields including time, user display name, user principal name, location details, and identity information.
AADNonInteractiveUserSignInLogs
| where UserPrincipalName == "adarsh@xyz.com" // replace the user name
| extend city = tostring(parse_json(LocationDetails).city)
| extend countryOrRegion = tostring(parse_json(LocationDetails).countryOrRegion)
| extend state = tostring(parse_json(LocationDetails).state)
| sort by TimeGenerated desc
| project TimeGenerated, UserDisplayName, UserPrincipalName, city, countryOrRegion, state, Location, Identity


// Query: 2
// This query checks the user's sign-in details with location
SigninLogs
| where Identity contains "adarsh" // replace the user name
| extend city = tostring(LocationDetails.city)
| extend countryOrRegion = tostring(LocationDetails.countryOrRegion)
| extend state = tostring(LocationDetails.state)
| sort by TimeGenerated desc
| project TimeGenerated, Identity, IPAddress, city, countryOrRegion, state, Location


// Query: 3
// This query checks the user's sign-in details with location and summarize the counts
SigninLogs
| where Identity contains "adarsh" // replace the user name
| extend city = tostring(LocationDetails.city)
| extend countryOrRegion = tostring(LocationDetails.countryOrRegion)
| extend state = tostring(LocationDetails.state)
| sort by TimeGenerated desc
| project TimeGenerated, Identity, IPAddress, city, countryOrRegion, state, Location
| summarize count() by bin(TimeGenerated, 1h)
| render columnchart

// Query: 4
// This query checks the user's 14 days sign-in details with location and summarize the counts with columnchart
SigninLogs
| where TimeGenerated >= startofday(ago(14d))
| where Identity contains "adarsh" // replace the user name
| extend city = tostring(LocationDetails.city)
| extend countryOrRegion = tostring(LocationDetails.countryOrRegion)
| extend state = tostring(LocationDetails.state)
| sort by TimeGenerated desc
| project TimeGenerated, Identity, IPAddress, city, countryOrRegion, state, Location
| summarize count() by bin(TimeGenerated, 1h)
| render columnchart  
