
// Query: User Sign-in details with location 
// This query checks the user's sign-in details with location
SigninLogs
| where Identity contains "adarsh" // replace the user name
| extend city = tostring(LocationDetails.city)
| extend countryOrRegion = tostring(LocationDetails.countryOrRegion)
| extend state = tostring(LocationDetails.state)
| sort by TimeGenerated desc
| project TimeGenerated, Identity, IPAddress, city, countryOrRegion, state, Location
