// KQL: Get all the Audit operations in last 24 hours
// Developed by: Adasrh Pandey
// Description: Get all the Audit operations in last 24 hours
AuditLogs 
| where TimeGenerated > ago(24h)
| summarize count() by OperationName
| order by count_ desc 
