// KQL: Identify all password changes for an account 
// Developed by: Adasrh Pandey
// Description: Identify all password changes for an account 
SecurityEvent
| where TimeGenerated > ago(180d)
| where EventID in ("4723", "4724", "4738")
| where TargetAccount contains "User1"
| project TimeGenerated, TargetAccount, Activity, SubjectAccount, Computer, PasswordLastSet
| order by TimeGenerated desc
