// KQL: Password changes in Active Directory
// Developed by: Adasrh Pandey
// Description: This query detects password changes in Active Directory
SecurityEvent
| where TimeGenerated >= ago(7d)
| where EventID == 4723
| where isnotempty(TargetUserName)  
| summarize count() by TargetUserName
| where count_ > 1
| order by count_ desc 
